README.html
<!-- <xml version="1.0"> -->
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <meta name="generator" content=
  "HTML Tidy for Cygwin (vers 1st September 2004), see www.w3.org" />

  <title>README</title><!-- 2013-10-21 Mon 22:28 -->
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta name="generator" content="Org-mode" />
  <meta name="author" content="Fabrice Niessen" />
  <meta name="description" content=
  "Implement many AUCTeX key bindings for Org mode documents" />
  <meta name="keywords" content=
  "org mode, latex, auctex, key bindings, shortcuts, emulation" />
</head>

<body>
  <div id="content">
    <h1 class="title">README</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li>
            <a href="#sec-1">1. org-auctex-key-bindings</a>

            <ul>
              <li><a href="#sec-1-1">1.1. Download</a></li>

              <li><a href="#sec-1-2">1.2. Installation</a></li>

              <li><a href="#sec-1-3">1.3. Usage</a></li>

              <li>
                <a href="#sec-1-4">1.4. AUCTeX keyboard shortcuts</a>

                <ul>
                  <li><a href="#sec-1-4-1">1.4.1. Enabled AUCTeX shortcuts for
                  Org mode</a></li>

                  <li><a href="#sec-1-4-2">1.4.2. Disabled Org mode
                  shortcuts</a></li>
                </ul>
              </li>

              <li><a href="#sec-1-5">1.5. License</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-sec-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span>
      org-auctex-key-bindings</h2>

      <div class="outline-text-2" id="text-1">
        <p>Implement many AUCTeX key bindings for Org mode documents, by giving
        them an “Org equivalent” or Org-like effect.</p>
      </div>

      <div id="outline-container-sec-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span>
        Download</h3>

        <div class="outline-text-3" id="text-1-1">
          <p>Get the full Git repository at <a href=
          "https://github.com/fniessen/org-auctex-key-bindings">https://github.com/fniessen/org-auctex-key-bindings</a>
          using the following command:</p>

          <div class="org-src-container">
            <pre class="src src-sh">
git clone https://github.com/fniessen/org-auctex-key-bindings.git
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-sec-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span>
        Installation</h3>

        <div class="outline-text-3" id="text-1-2">
          <ul class="org-ul">
            <li>Install <a href=
            "https://github.com/fniessen/org-auctex-key-bindings">org-auctex-key-bindings</a>:

              <div class="org-src-container">
                <pre class="src src-emacs-lisp">
<span style="color: #008200;">;; </span><span style=
"color: #008200; font-style: italic;">make sure `</span><span style=
"color: #008200; font-style: italic;">org-auctex-key-bindings.el</span><span style="color: #008200; font-style: italic;">' is in your `</span><span style="color: #008200; font-style: italic;">load-path</span><span style="color: #008200; font-style: italic;">'</span>
(add-to-list 'load-path <span style=
"color: #FF4700;">"/path/to/org-auctex-key-bindings"</span>)

<span style="color: #008200;">;; </span><span style=
"color: #008200; font-style: italic;">require it as normal</span>
(<span style="color: #0000FF;">require</span> '<span style=
"color: #6434A3;">org-auctex-keys</span>)
</pre>
              </div>
            </li>

            <li>Restart Emacs.</li>
          </ul>
        </div>
      </div>

      <div id="outline-container-sec-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> Usage</h3>

        <div class="outline-text-3" id="text-1-3">
          <p>Whenever you want to use AUCTeX key bindings inside your Org
          document, press <code>C-+</code> or type:</p>

          <div class="org-src-container">
            <pre class="src src-emacs-lisp">
M-x org-auctex-keys-minor-mode
</pre>
          </div>

          <p>You should now see <code>AUCKeys</code> in the list of minor
          modes, in your mode line.</p>

          <p>Calling the same command another time (via <code>C-+</code> or
          <code>M-x org-auctex-keys-minor-mode</code>) will disable the
          <code>AUCKeys</code> minor mode.</p>

          <p>To get it automatically turned on in every Org buffer, add this in
          your Emacs configuration file:</p>

          <div class="org-src-container">
            <pre class="src src-emacs-lisp">
(add-hook 'org-mode-hook 'org-auctex-keys-minor-mode)
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-sec-1-4" class="outline-3">
        <h3 id="sec-1-4"><span class="section-number-3">1.4</span> AUCTeX
        keyboard shortcuts</h3>

        <div class="outline-text-3" id="text-1-4">
          <p>Save time and boost your productivity in Org documents with AUCTeX
          keyboard shortcuts.</p>
        </div>

        <div id="outline-container-sec-1-4-1" class="outline-4">
          <h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span>
          Enabled AUCTeX shortcuts for Org mode</h4>

          <div class="outline-text-4" id="text-1-4-1">
            <p>Currently implemented:</p>

            <table border="2" cellspacing="0" cellpadding="6" rules="groups"
            frame="hsides">
              <colgroup>
                <col class="left" />
                <col class="left" />
              </colgroup>

              <thead>
                <tr>
                  <th scope="col" class="left">Shortcut</th>

                  <th scope="col" class="left">What it runs</th>
                </tr>
              </thead>

              <tbody>
                <tr>
                  <td class="left"><code>C-c C-s</code></td>

                  <td class="left"><code>org-auckeys-insert-heading</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-j</code></td>

                  <td class="left">
                  <code>org-auckeys-insert-heading-respect-content</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-f C-e</code></td>

                  <td class="left"><code>org-auckeys-font</code>
                  (emphasize)</td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-f C-b</code></td>

                  <td class="left"><code>org-auckeys-font</code> (bold)</td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-f C-t</code></td>

                  <td class="left"><code>org-auckeys-font</code>
                  (typewriter)</td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-f C-i</code></td>

                  <td class="left"><code>org-auckeys-font</code> (italic)</td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-e</code></td>

                  <td class="left"><code>org-auckeys-environment</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-c</code></td>

                  <td class="left">
                  <code>org-auckeys-export-dispatch</code></td>
                </tr>
              </tbody>
            </table>

            <p>As I’m not a heavy user of AUCTeX, I don’t know which other
            AUCTeX keys are important to be offered by this minor mode. Please
            tell me!</p>
          </div>
        </div>

        <div id="outline-container-sec-1-4-2" class="outline-4">
          <h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span>
          Disabled Org mode shortcuts</h4>

          <div class="outline-text-4" id="text-1-4-2">
            <p>As there are conflicts between AUCTeX and Org key bindings,
            whenever this minor mode is enabled, you’ll temporarily loose the
            standard behavior of:</p>

            <table border="2" cellspacing="0" cellpadding="6" rules="groups"
            frame="hsides">
              <colgroup>
                <col class="left" />
                <col class="left" />
              </colgroup>

              <thead>
                <tr>
                  <th scope="col" class="left">Shortcut</th>

                  <th scope="col" class="left">What it ran</th>
                </tr>
              </thead>

              <tbody>
                <tr>
                  <td class="left"><code>C-c C-s</code></td>

                  <td class="left"><code>org-schedule</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-j</code></td>

                  <td class="left"><code>org-goto</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-f</code></td>

                  <td class="left">
                  <code>org-forward-heading-same-level</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-e</code></td>

                  <td class="left"><code>org-export-dispatch</code></td>
                </tr>

                <tr>
                  <td class="left"><code>C-c C-c</code></td>

                  <td class="left"><code>org-ctrl-c-ctrl-c</code></td>
                </tr>
              </tbody>
            </table>

            <p>Though, you can easily regain them — without leaving
            <code>org-auctex-keys</code> — by prefixing your keys with one
            <code>C-u</code>. That will call the standard Org command without
            the <code>C-u</code> prefix.</p>

            <p>In fact, it calls the standard Org command with one less
            <code>C-u</code> prefix; so:</p>

            <ul class="org-ul">
              <li><code>C-u C-c C-s</code> calls the original
              <code>org-schedule</code>,</li>

              <li><code>C-u C-u C-c C-s</code> calls the original
              <code>org-schedule</code> with <b>one</b> universal prefix
              argument,</li>

              <li><code>C-u C-u C-u C-c C-s</code> calls the original
              <code>org-schedule</code> with <b>two</b> universal prefix
              arguments,</li>

              <li>etc. (provided it makes sense)</li>
            </ul>

            <p>Another way to access a disabled Org mode shortcut is to disable
            <code>org-auctex-keys</code> temporarily, do what you want, and
            re-enable it; that is, press <code>C-+ C-c C-s C-+</code> to call
            the original <code>org-schedule</code>.</p>
          </div>
        </div>
      </div>

      <div id="outline-container-sec-1-5" class="outline-3">
        <h3 id="sec-1-5"><span class="section-number-3">1.5</span> License</h3>

        <div class="outline-text-3" id="text-1-5">
          <p>Copyright (C) 2013 Fabrice Niessen</p>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <div id="copyright">
      © 2012-06-22 Fabrice Niessen
    </div>
  </div>
</body>
</html>
